<script lang="ts">
import type { Editor } from "$lib/editor";
import { draggable } from "@neodrag/svelte";
import { setContext } from "svelte";
import KanaButton from "./KanaButton.svelte";

let { editor, shown = $bindable(false) }: { editor: Editor; shown?: boolean } =
	$props();
setContext("editor", editor);

const KANA_TABLE = [
	["あ", ["𛀂", "𛀅", "𛀃", "𛀄"]],
	["い", ["𛀆", "𛀇", "𛀈", "𛀉"]],
	["う", ["𛀊", "𛀋", "𛀌", "𛀍", "𛀎"]],
	["え", ["𛀁", "𛀏", "𛀐", "𛀑", "𛀒", "𛀓"]],
	["お", ["𛀔", "𛀕", "𛀖"]],
	[
		"か",
		["𛀗", "𛀘", "𛀙", "𛀚", "𛀛", "𛀢", "𛀜", "𛀝", "𛀞", "𛀟", "𛀠", "𛀡"],
	],
	["き", ["𛀣", "𛀤", "𛀥", "𛀦", "𛀻", "𛀧", "𛀨", "𛀩", "𛀪"]],
	["く", ["𛀫", "𛀬", "𛀭", "𛀮", "𛀯", "𛀰", "𛀱"]],
	["け", ["𛀳", "𛀲", "𛀢", "𛀴", "𛀵", "𛀶", "𛀷"]],
	["こ", ["𛀸", "𛂘", "𛀹", "𛀻", "𛀺"]],
	["さ", ["𛀼", "𛀽", "𛀾", "𛀿", "𛁀", "𛁁", "𛁂", "𛁃"]],
	["し", ["𛁄", "𛁅", "𛁆", "𛁇", "𛁈", "𛁉"]],
	["す", ["𛁊", "𛁋", "𛁌", "𛁍", "𛁎", "𛁏", "𛁐", "𛁑"]],
	["せ", ["𛁒", "𛁓", "𛁔", "𛁕", "𛁖"]],
	["そ", ["𛁗", "𛁘", "𛁙", "𛁚", "𛁛", "𛁜", "𛁝"]],
	["た", ["𛁞", "𛁟", "𛁠", "𛁡"]],
	["ち", ["𛁢", "𛁣", "𛁤", "𛁥", "𛁦", "𛁧", "𛁨"]],
	["つ", ["𛁩", "𛁪", "𛁫", "𛁬", "𛁭"]],
	["て", ["𛁮", "𛁯", "𛁰", "𛁱", "𛁲", "𛁳", "𛁴", "𛁵", "𛁶", "𛂎"]],
	["と", ["𛁷", "𛁸", "𛁹", "𛁺", "𛁻", "𛁼", "𛁽", "𛁭"]],
	["な", ["𛁾", "𛁿", "𛂀", "𛂁", "𛂂", "𛂃", "𛂄", "𛂅", "𛂆"]],
	["に", ["𛂇", "𛂈", "𛂉", "𛂊", "𛂋", "𛂌", "𛂍", "𛂎"]],
	["ぬ", ["𛂏", "𛂐", "𛂑"]],
	["ね", ["𛂒", "𛂓", "𛂔", "𛂕", "𛂖", "𛂗", "𛂘"]],
	["の", ["𛂙", "𛂚", "𛂛", "𛂜", "𛂝"]],
	["は", ["𛂞", "𛂟", "𛂠", "𛂡", "𛂢", "𛂣", "𛂤", "𛂥", "𛂦", "𛂧", "𛂨"]],
	["ひ", ["𛂩", "𛂪", "𛂫", "𛂬", "𛂭", "𛂮", "𛂯"]],
	["ふ", ["𛂰", "𛂱", "𛂲"]],
	["へ", ["𛂳", "𛂴", "𛂵", "𛂶", "𛂷", "𛂸", "𛂹"]],
	["ほ", ["𛂺", "𛂻", "𛂼", "𛂽", "𛂾", "𛂿", "𛃀", "𛃁"]],
	["ま", ["𛃂", "𛃃", "𛃄", "𛃅", "𛃆", "𛃇", "𛃈", "𛃖"]],
	["み", ["𛃉", "𛃊", "𛃋", "𛃌", "𛃍", "𛃎", "𛃏"]],
	["む", ["𛃐", "𛃑", "𛃒", "𛃓", "𛄝", "𛄞"]],
	["め", ["𛃔", "𛃕", "𛃖"]],
	["も", ["𛃗", "𛃘", "𛃙", "𛃚", "𛃛", "𛃜", "𛄝", "𛄞"]],
	["や", ["𛃝", "𛃞", "𛃟", "𛃠", "𛃡", "𛃢"]],
	null,
	["ゆ", ["𛃣", "𛃤", "𛃥", "𛃦"]],
	null,
	["よ", ["𛃧", "𛃨", "𛃩", "𛃪", "𛃫", "𛃬"]],
	["ら", ["𛃭", "𛃮", "𛃯", "𛃰"]],
	["り", ["𛃱", "𛃲", "𛃳", "𛃴", "𛃵", "𛃶", "𛃷"]],
	["る", ["𛃸", "𛃹", "𛃺", "𛃻", "𛃼", "𛃽"]],
	["れ", ["𛃾", "𛃿", "𛄀", "𛄁"]],
	["ろ", ["𛄂", "𛄃", "𛄄", "𛄅", "𛄆", "𛄇"]],
	["わ", ["𛄈", "𛄉", "𛄊", "𛄋", "𛄌"]],
	["ゐ", ["𛄍", "𛄎", "𛄏", "𛄐", "𛄑"]],
	null,
	["ゑ", ["𛄒", "𛄓", "𛄔", "𛄕"]],
	["を", ["𛄖", "𛄗", "𛄘", "𛄙", "𛄚", "𛄛", "𛄜", "𛀅"]],
	["ん", ["𛄝", "𛄞"]],
	null,
	null,
	null,
	null,
] as const;

let text = $state(editor.text);

editor.onchange(() => {
	text = editor.text;
});
</script> 

<div class="float-menu" use:draggable={{ bounds: 'body' }} role="dialog" title="ドラッグして移動、ダブルクリックして隠す" ondblclick={() => (shown = false)}>
  <div class="kana-table">
    {#each KANA_TABLE as k}
      {#if k}
        {@const [kana, variants] = k}
      <div class="row">
        <KanaButton display={kana} variants={variants} />
        </div>
      {:else}
        <div class="row"></div>
      {/if}
    {/each}
  </div>

</div>

<style>
  .float-menu {
    writing-mode: vertical-rl;

    position: fixed;
    bottom: 0;
    left: 50%;
    transform: translateX(-50%);
    background-color: #fbfbfb;
    z-index: 100;
    padding: 0.5em;
    gap: 0.5em;

    font-size: 0.85rem;

    border-radius: 0.5em;

    box-shadow: 4px 4px 1em #00000033;

    display: grid;
    grid-template-columns: auto 1fr;

    user-select: none;

		cursor: move;
  }

  .kana-table {
    display: grid;
    grid-template-columns: repeat(5, 1fr);
    gap: 0.25em;
  }
</style>
